app/controllers/habits_controller.rb

SELECT  "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @habit = Habit.find(params[:id])